In [24]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from sklearn.datasets import load_iris

In [75]:
dataset = pd.read_csv("Social_Network_Ads.csv")
x = dataset.iloc[:,1:-1]
y = dataset.iloc[:,-1]

In [76]:
from sklearn.model_selection import train_test_split

x_train, x_test, y_train, y_test = train_test_split(x,y,test_size = 0.25,random_state = 0)

In [77]:
dataset

     Age  EstimatedSalary  Purchased
0     19            19000          0
1     35            20000          0
2     26            43000          0
3     27            57000          0
4     19            76000          0
..   ...              ...        ...
395   46            41000          1
396   51            23000          1
397   50            20000          1
398   36            33000          0
399   49            36000          1

[400 rows x 3 columns]

In [78]:
x_train

     EstimatedSalary
250            39000
63            120000
312            50000
159           135000
283            21000
..               ...
323            30000
192            43000
117            52000
47             54000
172           118000

[300 rows x 1 columns]

In [79]:
y_train

250    0
63     1
312    0
159    1
283    1
      ..
323    1
192    0
117    0
47     0
172    0
Name: Purchased, Length: 300, dtype: int64

In [80]:
x_test

     EstimatedSalary
132            87000
309            50000
341            75000
196            79000
246            50000
..               ...
146            96000
135            63000
390            33000
264            90000
364           104000

[100 rows x 1 columns]

In [81]:
y_test

132    0
309    0
341    0
196    0
246    0
      ..
146    1
135    0
390    1
264    1
364    1
Name: Purchased, Length: 100, dtype: int64

In [82]:
from sklearn.tree import DecisionTreeClassifier

In [93]:
clf = DecisionTreeClassifier(criterion="entropy", random_state=0)

In [94]:
clf.fit(x_train,y_train)

DecisionTreeClassifier(criterion='entropy', random_state=0)

In [95]:
pred = clf.predict(x_test)

In [96]:
pred

array([0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1,
       0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 1,
       0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0,
       0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 0, 1,
       0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1], dtype=int64)

In [97]:
from sklearn.metrics import classification_report

In [98]:
print(classification_report(y_test, pred)) #Testing

              precision    recall  f1-score   support

           0       0.77      0.84      0.80        68
           1       0.58      0.47      0.52        32

    accuracy                           0.72       100
   macro avg       0.67      0.65      0.66       100
weighted avg       0.71      0.72      0.71       100

In [99]:
print(classification_report(y_train, clf.predict(x_train))) #Training

              precision    recall  f1-score   support

           0       0.84      0.94      0.89       189
           1       0.87      0.68      0.77       111

    accuracy                           0.85       300
   macro avg       0.85      0.81      0.83       300
weighted avg       0.85      0.85      0.84       300